app/controllers/todonts_controller.rb

SELECT * FROM "todos"
---
  def index
    @todos = Todo.all

SELECT * FROM "todos" WHERE ("todos"."id" = 4)
---
  def edit
    @todo = Todo.find(params[:id])

INSERT INTO "todos" ("name", "completed_at", "updated_at", "description", "created_at") VALUES('test', NULL, '2009-06-24 19:12:27', '', '2009-06-24 19:12:27')
---
  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT * FROM "todos" WHERE ("todos"."id" = 4)
UPDATE "todos" SET "completed_at" = '2009-06-24 04:00:00', "updated_at" = '2009-06-24 19:21:53' WHERE "id" = 12
---
  def update
    @todo = Todo.find(params[:id])
    #Fix the issue 'true' != true
    params[:todo][:complete] = params[:todo][:complete] == "true" if params[:todo][:complete].present?

    respond_to do |format|
      if @todo.update_attributes(params[:todo])

SELECT * FROM "todos" WHERE ("todos"."id" = 10)
DELETE FROM "todos" WHERE "id" = 10
---
  def destroy
    @todo = Todo.find(params[:id])

    flash[:notice] = "#{@todo.name} successfully removed"

    @todo.destroy