app/controllers/todos_controller.rb

SELECT * FROM "todos"
---
  def index
    @todos = Todo.all

SELECT * FROM "todos" WHERE ("todos"."id" = 1)
---
  def show
    @todo = Todo.find(params[:id])

SELECT * FROM "todos" WHERE ("todos"."id" = 1)
---
  def edit
    @todo = Todo.find(params[:id])

INSERT INTO "todos" ("name", "completed_at", "updated_at", "description", "created_at") VALUES('dont test', NULL, '2009-06-24 19:07:01', '', '2009-06-24 19:07:01')
---
  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT * FROM "todos" WHERE ("todos"."id" = 3)
UPDATE "todos" SET "name" = 'Clean Car!', "updated_at" = '2009-06-24 18:42:11' WHERE "id" = 4
---
  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])

SELECT * FROM "todos" WHERE ("todos"."id" = 2)
DELETE FROM "todos" WHERE "id" = 2
---
  def destroy
    @todo = Todo.find(params[:id])

    flash[:notice] = "#{@todo.name} successfully removed"

    @todo.destroy

SELECT * FROM "todos" WHERE ("todos"."id" = 6)
UPDATE "todos" SET "completed_at" = NULL, "updated_at" = '2009-06-24 19:32:13' WHERE "id" = 12
---
  def update_all
    @todos = params[:todos]
    @todos.each do |key, values|
      todo = Todo.find(key)
      values['complete'] = values['complete'] == '1' if values['complete'].present?
      todo.attributes = values
      todo.save!

SELECT * FROM "todos" WHERE ("todos"."id" = 12)
---
  def confirm_delete
    @todo = Todo.find(params[:id])